Revit 2027 API
StructuralSectionPolygonDefinition Enumeration
 Indicates how the structural section polygon contour is defined.
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum StructuralSectionPolygonDefinition
Public Enumeration StructuralSectionPolygonDefinition
public enum class StructuralSectionPolygonDefinition
type StructuralSectionPolygonDefinition
Members
Member name | Value | Description
Circumscribed | 1 |  Circumscribed polygon. Sides of the polygon are a specific distance from the center.
Inscribed | 0 |  Inscribed Polygon. The radius of the circle is measured to a vertex between sides of the polygon.
See Also
Reference
Autodesk.Revit.DB.Structure.StructuralSections Namespace